print('''
--------------------------------------------------------------------------------------------------------

                ███╗   ███╗██╗   ██╗██╗  ████████╗██╗██████╗ ██╗      ██████╗ ███████╗
                ████╗ ████║██║   ██║██║  ╚══██╔══╝██║██╔══██╗██║     ██╔═══██╗██╔════╝
                ██╔████╔██║██║   ██║██║     ██║   ██║██████╔╝██║     ██║   ██║███████╗
                ██║╚██╔╝██║██║   ██║██║     ██║   ██║██╔═══╝ ██║     ██║   ██║╚════██║
                ██║ ╚═╝ ██║╚██████╔╝███████╗██║   ██║██║     ███████╗╚██████╔╝███████║
                ╚═╝     ╚═╝ ╚═════╝ ╚══════╝╚═╝   ╚═╝╚═╝     ╚══════╝ ╚═════╝ ╚══════╝       

--------------------------------------------------------------------------------------------------------
Fazer um programa para ler dois números inteiros, e dizer se um número é múltiplo do outro.
''')

iNumero_1 = int(input("Insira o Primeiro Número: "))
iNumero_2 = int(input("Insira o Segundo Número: "))

iCalculo = iNumero_1 % iNumero_2 

if iCalculo == 0: 
    print("\nOs números",iNumero_1,"e",iNumero_2,"são múltiplos.\n")

else:
    print("\nOs números",iNumero_1,"e",iNumero_2,"não são múltiplos.\n")